src/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыСтавокНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыСтавокНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пониженная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нулевая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пониженная2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяРасчетная2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыИзмеряемыхВеличин.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ТипыИзмеряемыхВеличин</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Площадь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Длина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоШтук</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упаковка</Name>
					<Comment>Выбирается программно, </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мощность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Энергия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектрическийЗаряд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Время</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/РеквизитыСопоставленияНоменклатурыБизнесСеть.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>РеквизитыСопоставленияНоменклатурыБизнесСеть</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Производитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вес</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/КатегорииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>КатегорииНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАлкогольнойПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтавкиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмпортнаяАлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПоКлассификатору</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодОценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодОценкиЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствХарактеристики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьЗаполнениеХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаЗапасов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполненияЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатурыПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЦенника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПроизводителяВЕТИСПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗаписьСкладскогоЖурналаВЕТИСПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИдентификаторПартииВЕТИСПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДатуПроизводстваПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСрокГодностиПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиГенерироватьПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНомерПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодконтрольнаяПродукцияВЕТИС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПополнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПополненияЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствСпецификации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМаркировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМВид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКиЗГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМСпособВыпускаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыпускаВОборотГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМРазмер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РазмерыКиЗГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТНВЭДГИСМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабачнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительИмпортерАлкогольнойПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбувнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукцииИС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодакцизныйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСерииНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолитикаУчетаСерий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолитикаУчетаСерий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальныеНастройкиПолитикиУчетаСерий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСрокГодностиСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДатуПроизводстваСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьУказанияСрокаГодностиСерии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТочностиУказанияСрокаГодности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУникальныеСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствКомплектацииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокСортировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/РаботаСНоменклатуройУНФ/Ext/Module.bsl
#Область РаботаСНоменклатуройПереопределяемый

// В запросе должны быть описаны временные таблицы с предопределенными полями (псевдонимами).
// На основании данных таблиц формируются файлы выгрузки номенклатуры.
//
// Если в прикладном решении отсутствуют данные для заполнения какого-то поля, либо целой таблицы, кроме обязательных,
// то это поле (или таблицу) следует исключить из запроса полностью, либо инициализировать значением(значениями) NULL.
// Обязательные таблицы и поля должны присутствовать в запросе даже если нет источников данных для их заполнения - в
// этом случае инициализировать поля значениями NULL
//
// На входе запрос содержит текст создания временной таблицы ОтборНоменклатуры, которая служит для ограничения выборки.
// Формируется на основе текста запроса, полученного методом ИнициализацияЗапросаОтбораДанныхНоменклатуры.
// Поля таблицы:
//  * Номенклатура   - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Характеристика - ОпределяемыйТип.ХарактеристикаРаботаСНоменклатурой - ссылка на характеристику.
//      Если ОтборНоменклатуры.Характеристика ЕСТЬ NULL, то нужно получить данные по всем характеристикам номенклатуры
//  * ВидНоменклатуры - ОпределяемыйТип.ВидНоменклатурыРаботаСНоменклатурой - вид номенклатуры, может быть NULL, если
//                                                                            виды номенклатуры не используются.
//  * Родитель        - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - группа товара в иерархии, может быть NULL,
//      если справочник номенклатуры не иерархический.
// 
// Параметры запроса:
//  * ИсключенныеДополнительныеРеквизиты    - Массив - доп.реквизиты, запрещенные к выгрузке пользователем. Выгружать
//      надо все доп.реквизиты кроме исключений, заданных этим параметром.
//  * ВыгружатьИндивидуальныеХарактеристики - Булево   - признак необходимости выгружать индивидуальные характеристики номенклатуры.
//  * ИсключенныеВидыНоменклатуры           - Массив - виды номенклатуры, по которым пользователь запретил выгружать
//      характеристики. По всем остальным видам характеристики выгружаются.
// * Параметры запроса - строковые константы:
// * Ставки НДС:
//  * НДС0  - Строка - без НДС (или НДС 0%).
//  * НДС10 - Строка - НДС 10%.
//  * НДС18 - Строка - НДС 18%.
//  * НДС20 - Строка - НДС 20%.
// * Типы номенклатуры:
//  * Товар  - Строка - тип номенклатуры "Товар".
//  * Услуга - Строка - тип номенклатуры "Услуга".
// * Типы измеряемых величин:
//  * Вес                - Строка
//  * Объем              - Строка
//  * Площадь            - Строка
//  * Длина              - Строка
//  * КоличествоШтук     - Строка
//  * Упаковка           - Строка
//  * Мощность           - Строка
//  * Энергия            - Строка
//  * ЭлектрическийЗаряд - Строка
//  * Время              - Строка
// Классификаторы:
//  * ОКПД2  - Строка
//  * ТНВЭД  - Строка
//  * ЕГАИС  - Строка
//  * ОКВЭД2 - Строка
//
// Временные таблицы и предопределенные поля:
// Товары
//  * Номенклатура                - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Характеристика              - ОпределяемыйТип.ХарактеристикаРаботаСНоменклатурой - ссылка на характеристику.
//  * Наименование                - Строка - наименование товара.
//  * ХарактеристикаНаименование  - Строка - наименование характеристики.
//  * Артикул                     - Строка - артикул товара.
//  * СтавкаНДС                   - Строка - ставка НДС, значение из списка: &НДС0, &НДС10, &НДС18, &НДС20.
//  * ЕдиницаИзмерения                        - Строка - наименование базовой единицы измерения товара.
//  * ЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения товара.
//  * ЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - значение из списка: &Вес, &Объем, &Площадь, &Длина,
//      &КоличествоШтук, &Упаковка, &Мощность, &Энергия, &ЭлектрическийЗаряд, &Время.
//  * ЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения товара.
//  * ЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения товара.
//  * ЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения товара.
//  * ЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения товара к базовой величине.
//  * ЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения товара к базовой величине.
//  * ТипНоменклатуры             - Строка - значение из списка: &Товар, &Услуга.
//  * Описание                    - Строка - текстовое описание товара.
//  * НаименованияДляПечатиЧека   - Строка - краткое наименование товара для печати чека.
//  * ВестиУчетПоГТД              - Булево - вести учет по ГТД.
//  * ПродукцияМаркируемаяДляГИСМ - Булево - продукция, маркируемая для ГИСМ.
//  * ПодакцизныйТовар            - Булево - подакцизный товар.
//  * СтранаПроисхождения         - Строка - код страны происхождения товара согласно ОКСМ.
//  * Производитель               - Ссылка - ссылка (уникальный идентификатор) производителя.
//  * ПроизводительНаименование   - Строка - наименование производителя.
//  * ПроизводительИНН            - Строка - ИНН производителя.
//  * ПроизводительКПП            - Строка - КПП производителя.
//  * Марка                       - Ссылка - ссылка (уникальный идентификатор) марки (бренда).
//  * МаркаНаименование           - Строка - наименование марки (бренда).
//  * КоличествоВУпаковке                                        - Число  - количество штук в 1 единице (упаковке) товара. Например: 1 пачка фломастеров содержит 10 штук фломастеров.
//  * КоличествоВУпаковкеЕдиницаИзмерения                        - Строка - наименование единицы измерения количества штук.
//  * КоличествоВУпаковкеЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения количества штук.
//  * КоличествоВУпаковкеЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &КоличествоШтук.
//  * КоличествоВУпаковкеЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения количества штук.
//  * КоличествоВУпаковкеЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения количества штук.
//  * КоличествоВУпаковкеЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения количества штук.
//  * КоличествоВУпаковкеЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения количества штук к базовой величине.
//  * КоличествоВУпаковкеЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения количества штук к базовой величине.
//  * ВесЧислитель                               - Число  - числитель отношения единицы измерения веса к единице измерения товара.
//  * ВесЗнаменатель                             - Число  - знаменатель отношения единицы измерения веса к единице измерения товара.
//  * ВесЕдиницаИзмерения                        - Строка - наименование единицы измерения веса.
//  * ВесЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения веса.
//  * ВесЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &Вес.
//  * ВесЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения веса.
//  * ВесЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения веса.
//  * ВесЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения веса.
//  * ВесЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения веса к базовой величине.
//  * ВесЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения веса к базовой величине.
//  * ДлинаЧислитель                               - Число  - числитель отношения единицы измерения длины к единице измерения товара.
//  * ДлинаЗнаменатель                             - Число  - знаменатель отношения единицы измерения длины к единице измерения товара.
//  * ДлинаЕдиницаИзмерения                        - Строка - наименование единицы измерения длины.
//  * ДлинаЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения длины.
//  * ДлинаЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &Длина.
//  * ДлинаЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения длины.
//  * ДлинаЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения длины.
//  * ДлинаЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения длины.
//  * ДлинаЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения длины к базовой величине.
//  * ДлинаЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения длины к базовой величине.
//  * ОбъемЧислитель                               - Число  - числитель отношения единицы измерения объема к единице измерения товара.
//  * ОбъемЗнаменатель                             - Число  - знаменатель отношения единицы измерения объема к единице измерения товара.
//  * ОбъемЕдиницаИзмерения                        - Строка - наименование единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &Объем.
//  * ОбъемЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения объема к базовой величине.
//  * ОбъемЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения объема к базовой величине.
//  * ПлощадьЧислитель                               - Число  - числитель отношения единицы измерения площади к единице измерения товара.
//  * ПлощадьЗнаменатель                             - Число  - знаменатель отношения единицы измерения площади к единице измерения товара.
//  * ПлощадьЕдиницаИзмерения                        - Строка - наименование единицы измерения площади.
//  * ПлощадьЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения площади.
//  * ПлощадьЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - &Площадь.
//  * ПлощадьЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения площади.
//  * ПлощадьЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения площади.
//  * ПлощадьЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения площади.
//  * ПлощадьЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения площади к базовой величине.
//  * ПлощадьЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения площади к базовой величине.
// КРИТИЧЕСКИ ВАЖНО! Таблица Товары должна содержать ровно по 1 строке на сочетание Номенклатура + Характеристика
// Поддерживается выгрузка дополнительных свойств Номенклатуры, не включенных в указанный выше список полей.
// Это означает, что все поля таблицы Товары будут включены в пакет выгрузки, как описанные выше, так и прочие.
// Например, таким образом можно добавлять данные из регистров сведений.
//
// Категории:
//  * Номенклатура - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Категория    - ОпределяемыйТип.ОбъектыСопоставленияБизнесСеть - ссылка на категорию.
//  * Наименование - Строка - наименование категории.
//  * Родитель     - ОпределяемыйТип.ОбъектыСопоставленияБизнесСеть - родитель категории в иерархии.
// Пояснение.
// Категории - это способ деления товаров на группы.
// В общем случае предполагается, что категорией может быть вид номенклатуры, либо родитель в иерархии номенклатуры.
// Наличие таблицы в запросе обязательно.
// Если в конфигурации нет возможности разделить номенклатуру на категории, следует инициализировать таблицу значениями NULL по всем полям.
// Минимально необходимо описать 2 уровня иерархии. 
// То есть если справочник Номенклатура иерархический, то в список категорий должны попасть Родитель и Родитель.Родитель.
// Если виды номенклатуры используются, то в списке категорий должны быть ВидНоменклатуры и ВидНоменклатуры.Родитель.
// Допускается и более глубокое описание иерархии - 3, 4 и т.д. уровней.
// 
// Свойства:
//  * Номенклатура           - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Характеристика         - ОпределяемыйТип.ХарактеристикаРаботаСНоменклатурой - ссылка на характеристику.
//  * Свойство               - Ссылка - свойство товара.
//  * Значение               - Произвольный - значение свойства товара.
//  * РеквизитХарактеристики - Булево - признак свойства характеристики.
// ВАЖНО! В разрезе характеристик указать только свойства характеристик (СвойствоХарактеристики = ИСТИНА).
// Для свойств номенклатуры (СвойствоХарактеристики = ЛОЖЬ) характеристику не заполнять, указать NULL.
// Свойства номенклатуры не должны дублироваться (размножаться на количество различных характеристик номенклатуры).
//
// Штрихкоды:
//  * Номенклатура   - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Характеристика - ОпределяемыйТип.ХарактеристикаРаботаСНоменклатурой - ссылка на характеристику.
//  * Упаковка       - Ссылка - единица измерения упаковки товара.
//  * Штрихкод       - Строка - штрихкод.
//
// Упаковки:
//  * Номенклатура         - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Ссылка               - Ссылка - ссылка (уникальный идентификатор) на упаковку.
//  * Наименование         - Строка - наименование упаковки.
//  * Родитель             - Ссылка - «родительская» (внешняя, более крупная) упаковка.
//  * РодительНаименование - Строка - наименование «родительской» упаковки.
//  * ЕдиницаКодОКЕИ       - Строка - код ОКЕИ единицы измерения упаковки.
//  * ЕдиницаНаименование  - Строка - наименование единицы измерения упаковки.
//  * Числитель            - Число  - числитель отношения единицы измерения к упаковке.
//  * Знаменатель          - Число  - знаменатель отношения единицы измерения к упаковке.
//  * Вес                                        - Число  - вес упаковки (брутто).
//  * ВесЕдиницаИзмерения                        - Строка - наименование единицы измерения веса.
//  * ВесЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения веса.
//  * ВесЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &Вес.
//  * ВесЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения веса.
//  * ВесЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения веса.
//  * ВесЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения веса.
//  * ВесЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения веса к базовой величине.
//  * ВесЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения веса к базовой величине.
//  * Объем                                        - Число  - объем упаковки.
//  * ОбъемЕдиницаИзмерения                        - Строка - наименование единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &Объем.
//  * ОбъемЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения объема.
//  * ОбъемЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения объема к базовой величине.
//  * ОбъемЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения объема к базовой величине.
//  * Высота                                        - Число  - высота упаковки.
//  * ВысотаЕдиницаИзмерения                        - Строка - наименование единицы измерения высоты.
//  * ВысотаЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения высоты.
//  * ВысотаЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &Длина.
//  * ВысотаЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения высоты.
//  * ВысотаЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения высоты.
//  * ВысотаЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения высоты.
//  * ВысотаЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения высоты к базовой величине.
//  * ВысотаЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения высоты к базовой величине.
//  * Ширина                                        - Число  - ширина упаковки.
//  * ШиринаЕдиницаИзмерения                        - Строка - наименование единицы измерения ширины.
//  * ШиринаЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения ширины.
//  * ШиринаЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &Длина.
//  * ШиринаЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения ширины.
//  * ШиринаЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения ширины.
//  * ШиринаЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения ширины.
//  * ШиринаЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения ширины к базовой величине.
//  * ШиринаЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения ширины к базовой величине.
//  * Глубина                                        - Число  - глубина упаковки.
//  * ГлубинаЕдиницаИзмерения                        - Строка - наименование единицы измерения глубины.
//  * ГлубинаЕдиницаИзмеренияКодОКЕИ                 - Строка - код ОКЕИ единицы измерения глубины.
//  * ГлубинаЕдиницаИзмеренияТипИзмеряемойВеличины   - Строка - ожидаемое значение &Длина.
//  * ГлубинаЕдиницаИзмеренияНаименованиеПолное      - Строка - полное наименование единицы измерения глубины.
//  * ГлубинаЕдиницаИзмеренияМеждународноеСокращение - Строка - международное сокращение единицы измерения глубины.
//  * ГлубинаЕдиницаИзмеренияБазоваяЕдиница          - Строка - код ОКЕИ базовой величины для единицы измерения глубины.
//  * ГлубинаЕдиницаИзмеренияЧислитель               - Число  - числитель отношения единицы измерения глубины к базовой величине.
//  * ГлубинаЕдиницаИзмеренияЗнаменатель             - Число  - знаменатель отношения единицы измерения глубины к базовой величине.
//
// Классификаторы:
//  * Номенклатура   - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Наименование   - Строка - имя классификатора, значение из списка &ОКПД2, &ТНВЭД, &ЕГАИС, &ОКВЭД2.
//  * Код            - Строка - код элемента классификатора.
//  * Описание       - Строка - название кода.
//
// Изображения:
//  * Номенклатура - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Файл         - Ссылка - ссылка (уникальный идентификатор) на файл.
//  * Наименование - Строка - наименование файла.
//  * Гиперссылка  - Строка - URL файла.
//
// Вложения:
//  * Номенклатура - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Файл         - Ссылка - ссылка (уникальный идентификатор) на файл.
//  * Наименование - Строка - наименование файла.
//  * Гиперссылка  - Строка - URL файла.
// 
// Сертификаты:
//  * Номенклатура               - ОпределяемыйТип.НоменклатураРаботаСНоменклатурой - ссылка на товар.
//  * Сертификат                 - Ссылка - ссылка на сертификат.
//  * Номер                      - Строка - номер.
//  * ДатаНачалаСрокаДействия    - ДатаВремя - дата выдачи.
//  * ДатаОкончанияСрокаДействия - ДатаВремя - дата окончания срока действия.
//  * ТипСертификата             - Строка - тип сертификата.
//  * ОрганВыдавшийДокумент      - Строка - орган выдавший документ.
//
// ВложенияСертификатов:
//  * Сертификат   - Ссылка - ссылка на сертификат.
//  * Файл         - Ссылка - ссылка (уникальный идентификатор) на файл.
//  * Наименование - Строка - наименование файла.
//  * Гиперссылка  - Строка - URL файла.
//
// Обязательные таблицы и поля:
// Товары
//  * Номенклатура,
//  * Характеристика.
// Свойства: все поля.
// Категории: все поля.
// Штрихкоды: Номенклатура.
//
// При необходимости возможно добавление в пакет данных выгрузки произвольных дополнительных сведений общего характера, без привязки к товарной позиции.
// Для этого в тексте запроса можно описать любое нужное количество дополнительных запросов без создания временной таблицы.
// Важно, чтобы все эти запросы не использовали никакие вышеописанные временные таблицы, относящиеся к номенклатуре, так как
//  выполняться эти запросы будут отдельно от запроса по номенклатуре, поскольку речь идет о сведениях, общих для всего пакета данных в целом.
// Если добавляемые в пакет дополнительные сведения имеют сложную структуру (не одномерный массив полей, а многомерный массив), то 
//  имя таблицы источника данных нужно сформировать по шаблону ДополнительныеДанные_ИмяТаблицы.
// В этом случае в пакет добавится дополнительное свойство ИмяТаблицы, значение которого будет заполнено данными запроса.
// Если таблица с префиксом ДополнительныеДанные_ в секции ИЗ не найдена,
//  то все полученные запросом дополнительные сведения добавляются в пакет как одномерный массив пар значений <имя поля> - <значение поля>.
//
// Параметры:
//  Запрос - Запрос - запрос для получения данных номенклатуры.
//
Процедура ИнициализацияЗапросаВыборкиДанныхДляВыгрузки(Запрос) Экспорт

	Запрос.Текст = Запрос.Текст + Символы.ПС + ";" + Символы.ПС
	+ "ВЫБРАТЬ
	  |	СправочникНоменклатура.Ссылка КАК Номенклатура,
	  |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ХарактеристикиВидаНоменклатуры.Ссылка) КАК Характеристика,
	  |	СправочникНоменклатура.Наименование КАК Наименование,
	  |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Наименование, ХарактеристикиВидаНоменклатуры.Наименование) КАК ХарактеристикаНаименование,
	  |	СправочникНоменклатура.Артикул КАК Артикул,
	  |	ВЫБОР
	  |		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Общая)
	  |			ТОГДА ""20""
	  |		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяРасчетная)
	  |			ТОГДА ""20""
	  |		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная)
	  |			ТОГДА ""10""
	  |		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная)
	  |			ТОГДА ""10""
	  |		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Нулевая)
	  |			ТОГДА ""0""
	  |		ИНАЧЕ ""0""
	  |	КОНЕЦ КАК СтавкаНДС,
	  |	СправочникНоменклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	  |	СправочникНоменклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодОКЕИ,
	  |	ВЫБОР
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	  |			ТОГДА &Вес
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	  |			ТОГДА &Объем
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	  |			ТОГДА &Площадь
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	  |			ТОГДА &Длина
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	  |			ТОГДА &КоличествоШтук
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	  |			ТОГДА &Упаковка
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Мощность)
	  |			ТОГДА &Мощность
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Энергия)
	  |			ТОГДА &Энергия
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.ЭлектрическийЗаряд)
	  |			ТОГДА &ЭлектрическийЗаряд
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Время)
	  |			ТОГДА &Время
	  |	КОНЕЦ КАК ЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	СправочникНоменклатура.ЕдиницаИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименованиеПолное,
	  |	СправочникНоменклатура.ЕдиницаИзмерения.МеждународноеСокращение КАК ЕдиницаИзмеренияМеждународноеСокращение,
	  |	ВЫБОР
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	  |			ТОГДА ""166 ""
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	  |			ТОГДА ""113 ""
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	  |			ТОГДА ""055 ""
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	  |			ТОГДА ""006 ""
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Мощность)
	  |			ТОГДА ""212 ""
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Энергия)
	  |			ТОГДА ""243 ""
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.ЭлектрическийЗаряд)
	  |			ТОГДА ""263 ""
	  |		КОГДА СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Время)
	  |			ТОГДА ""354 ""
	  |	КОНЕЦ КАК ЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ЕдиницаИзмеренияЗнаменатель,
	  |	ВЫБОР
	  |		КОГДА СправочникНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	  |			ТОГДА &Услуга
	  |		ИНАЧЕ &Товар
	  |	КОНЕЦ КАК ТипНоменклатуры,
	  |	NULL КАК Описание,
	  |	СправочникНоменклатура.НаименованиеПолное КАК НаименованияДляПечатиЧека,
	  |	NULL КАК ВестиУчетПоГТД,
	  |	NULL КАК ПродукцияМаркируемаяДляГИСМ,
	  |	NULL КАК ПодакцизныйТовар,
	  |	СправочникНоменклатура.СтранаПроисхождения.КодАльфа3 КАК СтранаПроисхождения,
	  | СправочникНоменклатура.СтранаПроисхождения.КодАльфа2 КАК СтранаПроизводства,
	  |	Производители.Ссылка КАК Производитель,
	  |	Производители.Наименование КАК ПроизводительНаименование,
	  |	Производители.ИНН КАК ПроизводительИНН,
	  |	Производители.КПП КАК ПроизводительКПП,
	  |	NULL КАК Марка,
	  |	NULL КАК МаркаНаименование,
	  |	NULL КАК КоличествоВУпаковке,
	  |	NULL КАК КоличествоВУпаковкеЕдиницаИзмерения,
	  |	NULL КАК КоличествоВУпаковкеЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК КоличествоВУпаковкеЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК КоличествоВУпаковкеЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК КоличествоВУпаковкеЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК КоличествоВУпаковкеЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК КоличествоВУпаковкеЕдиницаИзмеренияЧислитель,
	  |	NULL КАК КоличествоВУпаковкеЕдиницаИзмеренияЗнаменатель,
	  |	СправочникНоменклатура.Вес КАК ВесЧислитель,
	  |	1 КАК ВесЗнаменатель,
	  |	""кг"" КАК ВесЕдиницаИзмерения,
	  |	NULL КАК ВесЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ВесЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ВесЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ВесЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ВесЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ВесЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ВесЕдиницаИзмеренияЗнаменатель,
	  |	NULL КАК ДлинаЧислитель,
	  |	NULL КАК ДлинаЗнаменатель,
	  |	NULL КАК ДлинаЕдиницаИзмерения,
	  |	NULL КАК ДлинаЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ДлинаЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ДлинаЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ДлинаЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ДлинаЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ДлинаЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ДлинаЕдиницаИзмеренияЗнаменатель,
	  |	СправочникНоменклатура.Объем КАК ОбъемЧислитель,
	  |	1 КАК ОбъемЗнаменатель,
	  |	NULL КАК ОбъемЕдиницаИзмерения,
	  |	NULL КАК ОбъемЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ОбъемЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ОбъемЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ОбъемЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ОбъемЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ОбъемЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ОбъемЕдиницаИзмеренияЗнаменатель,
	  |	NULL КАК ПлощадьЧислитель,
	  |	NULL КАК ПлощадьЗнаменатель,
	  |	NULL КАК ПлощадьЕдиницаИзмерения,
	  |	NULL КАК ПлощадьЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ПлощадьЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ПлощадьЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ПлощадьЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ПлощадьЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ПлощадьЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ПлощадьЕдиницаИзмеренияЗнаменатель,
	  |	СправочникНоменклатура.Наименование КАК НаименованиеТовараВУчетнойСистеме,
	  |	СправочникНоменклатура.Код КАК КодТовараВУчетнойСистеме
	  |ПОМЕСТИТЬ Товары
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	  |		ПО ОтборНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка
	  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииНоменклатуры КАК ВидыНоменклатуры
	  |		ПО (СправочникНоменклатура.КатегорияНоменклатуры = ВидыНоменклатуры.Ссылка)
	  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиВидаНоменклатуры
	  |		ПО (ВидыНоменклатуры.Ссылка = ХарактеристикиВидаНоменклатуры.Владелец)
	  |			И (ВидыНоменклатуры.ИспользоватьХарактеристики = ИСТИНА)
	  |			И (НЕ ВидыНоменклатуры.Ссылка В (&ИсключенныеВидыНоменклатуры))
	  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	  |		ПО ОтборНоменклатуры.Номенклатура = ХарактеристикиНоменклатуры.Владелец
	  |			И (&ВыгружатьИндивидуальныеХарактеристики = ИСТИНА)
	  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Производители
	  |		ПО (СправочникНоменклатура.Производитель = Производители.Ссылка)
	  |ГДЕ
	  |	(ОтборНоменклатуры.Характеристика ЕСТЬ NULL
	  |			ИЛИ ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ХарактеристикиВидаНоменклатуры.Ссылка) = ОтборНоменклатуры.Характеристика)
	  |
	  |ИНДЕКСИРОВАТЬ ПО
	  |	Номенклатура,
	  |	Характеристика
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура КАК Номенклатура,
	  |	ОтборНоменклатуры.ВидНоменклатуры КАК Категория,
	  |	ОтборНоменклатуры.ВидНоменклатуры.Наименование КАК Наименование,
	  |	ОтборНоменклатуры.ВидНоменклатуры.Родитель КАК Родитель
	  |ПОМЕСТИТЬ Категории
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |ГДЕ
	  |	ОтборНоменклатуры.ВидНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КатегорииНоменклатуры.ПустаяСсылка)
	  |	И (ЕСТЬNULL(ОтборНоменклатуры.Характеристика, ИСТИНА), ИСТИНА) В
	  |			(ВЫБРАТЬ
	  |				МАКСИМУМ(ЕСТЬNULL(ТаблицаУсловия.Характеристика, ИСТИНА)),
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК ТаблицаУсловия
	  |			ГДЕ
	  |				ТаблицаУсловия.Номенклатура = ОтборНоменклатуры.Номенклатура)
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	ОтборНоменклатуры.ВидНоменклатуры.Родитель,
	  |	ОтборНоменклатуры.ВидНоменклатуры.Родитель.Наименование,
	  |	ОтборНоменклатуры.ВидНоменклатуры.Родитель.Родитель
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |ГДЕ
	  |	ОтборНоменклатуры.ВидНоменклатуры.Родитель <> ЗНАЧЕНИЕ(Справочник.КатегорииНоменклатуры.ПустаяСсылка)
	  |	И (ЕСТЬNULL(ОтборНоменклатуры.Характеристика, ИСТИНА), ИСТИНА) В
	  |			(ВЫБРАТЬ
	  |				МАКСИМУМ(ЕСТЬNULL(ТаблицаУсловия.Характеристика, ИСТИНА)),
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК ТаблицаУсловия
	  |			ГДЕ
	  |				ТаблицаУсловия.Номенклатура = ОтборНоменклатуры.Номенклатура)
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	ОтборНоменклатуры.Родитель,
	  |	ОтборНоменклатуры.Родитель.Наименование,
	  |	ОтборНоменклатуры.Родитель.Родитель
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |ГДЕ
	  |	ОтборНоменклатуры.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	  |	И (ЕСТЬNULL(ОтборНоменклатуры.Характеристика, ИСТИНА), ИСТИНА) В
	  |			(ВЫБРАТЬ
	  |				МАКСИМУМ(ЕСТЬNULL(ТаблицаУсловия.Характеристика, ИСТИНА)),
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК ТаблицаУсловия
	  |			ГДЕ
	  |				ТаблицаУсловия.Номенклатура = ОтборНоменклатуры.Номенклатура)
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	ОтборНоменклатуры.Родитель.Родитель,
	  |	ОтборНоменклатуры.Родитель.Родитель.Наименование,
	  |	ОтборНоменклатуры.Родитель.Родитель.Родитель
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |ГДЕ
	  |	ОтборНоменклатуры.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	  |	И (ЕСТЬNULL(ОтборНоменклатуры.Характеристика, ИСТИНА), ИСТИНА) В
	  |			(ВЫБРАТЬ
	  |				МАКСИМУМ(ЕСТЬNULL(ТаблицаУсловия.Характеристика, ИСТИНА)),
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК ТаблицаУсловия
	  |			ГДЕ
	  |				ТаблицаУсловия.Номенклатура = ОтборНоменклатуры.Номенклатура)
	  |
	  |ИНДЕКСИРОВАТЬ ПО
	  |	Номенклатура
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
	  |	NULL КАК Характеристика,
	  |	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
	  |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение,
	  |	ЛОЖЬ КАК РеквизитХарактеристики
	  |ПОМЕСТИТЬ Свойства
	  |ИЗ
	  |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	  |ГДЕ
	  |	НЕ НоменклатураДополнительныеРеквизиты.Свойство В (&ИсключенныеДополнительныеРеквизиты)
	  |	И ИСТИНА В
	  |			(ВЫБРАТЬ ПЕРВЫЕ 1
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК Товары
	  |			ГДЕ
	  |				Товары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка)
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	Товары.Номенклатура,
	  |	Товары.Характеристика,
	  |	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство,
	  |	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение,
	  |	ИСТИНА
	  |ИЗ
	  |	Товары КАК Товары
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	  |		ПО Товары.Характеристика = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка
	  |ГДЕ
	  |	НЕ ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство В (&ИсключенныеДополнительныеРеквизиты)
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	Номенклатура.Ссылка,
	  |	NULL,
	  |	&Свойство,
	  |	&Значение,
	  |	ЛОЖЬ
	  |ИЗ
	  |	Справочник.Номенклатура КАК Номенклатура
	  |ГДЕ
	  |	ИСТИНА В
	  |			(ВЫБРАТЬ ПЕРВЫЕ 1
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК Товары
	  |			ГДЕ
	  |				Товары.Номенклатура = Номенклатура.Ссылка)
	  |
	  |ИНДЕКСИРОВАТЬ ПО
	  |	Номенклатура,
	  |	Характеристика
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура КАК Номенклатура,
	  |	Штрихкоды.Характеристика КАК Характеристика,
	  |	Штрихкоды.ЕдиницаИзмерения КАК Упаковка,
	  |	Штрихкоды.Штрихкод КАК Штрихкод
	  |ПОМЕСТИТЬ Штрихкоды
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	  |		ПО ОтборНоменклатуры.Номенклатура = Штрихкоды.Номенклатура
	  |			И ОтборНоменклатуры.Характеристика = Штрихкоды.Характеристика
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	Штрихкоды.Характеристика,
	  |	Штрихкоды.ЕдиницаИзмерения,
	  |	Штрихкоды.Штрихкод
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	  |		ПО ОтборНоменклатуры.Номенклатура = Штрихкоды.Номенклатура
	  |			И (ОтборНоменклатуры.Характеристика ЕСТЬ NULL)
	  |
	  |ИНДЕКСИРОВАТЬ ПО
	  |	Номенклатура
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура КАК Номенклатура,
	  |	NULL КАК Характеристика,
	  |	УпаковкиНоменклатуры.Ссылка КАК Ссылка,
	  |	УпаковкиНоменклатуры.Наименование КАК Наименование,
	  |	NULL КАК Родитель,
	  |	NULL КАК РодительНаименование,
	  |	ВЫБОР
	  |		КОГДА УпаковкиНоменклатуры.ЕдиницаИзмеренияПоКлассификатору ССЫЛКА Справочник.КлассификаторЕдиницИзмерения
	  |			ТОГДА УпаковкиНоменклатуры.ЕдиницаИзмеренияПоКлассификатору.Код
	  |		ИНАЧЕ NULL
	  |	КОНЕЦ КАК ЕдиницаКодОКЕИ,
	  |	УпаковкиНоменклатуры.Наименование КАК ЕдиницаНаименование,
	  |	NULL КАК Числитель,
	  |	NULL КАК Знаменатель,
	  |	NULL КАК Вес,
	  |	NULL КАК ВесЕдиницаИзмерения,
	  |	NULL КАК ВесЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ВесЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ВесЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ВесЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ВесЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ВесЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ВесЕдиницаИзмеренияЗнаменатель,
	  |	NULL КАК Объем,
	  |	NULL КАК ОбъемЕдиницаИзмерения,
	  |	NULL КАК ОбъемЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ОбъемЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ОбъемЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ОбъемЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ОбъемЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ОбъемЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ОбъемЕдиницаИзмеренияЗнаменатель,
	  |	NULL КАК Высота,
	  |	NULL КАК ВысотаЕдиницаИзмерения,
	  |	NULL КАК ВысотаЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ВысотаЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ВысотаЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ВысотаЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ВысотаЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ВысотаЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ВысотаЕдиницаИзмеренияЗнаменатель,
	  |	NULL КАК Ширина,
	  |	NULL КАК ШиринаЕдиницаИзмерения,
	  |	NULL КАК ШиринаЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ШиринаЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ШиринаЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ШиринаЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ШиринаЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ШиринаЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ШиринаЕдиницаИзмеренияЗнаменатель,
	  |	NULL КАК Глубина,
	  |	NULL КАК ГлубинаЕдиницаИзмерения,
	  |	NULL КАК ГлубинаЕдиницаИзмеренияКодОКЕИ,
	  |	NULL КАК ГлубинаЕдиницаИзмеренияТипИзмеряемойВеличины,
	  |	NULL КАК ГлубинаЕдиницаИзмеренияНаименованиеПолное,
	  |	NULL КАК ГлубинаЕдиницаИзмеренияМеждународноеСокращение,
	  |	NULL КАК ГлубинаЕдиницаИзмеренияБазоваяЕдиница,
	  |	NULL КАК ГлубинаЕдиницаИзмеренияЧислитель,
	  |	NULL КАК ГлубинаЕдиницаИзмеренияЗнаменатель
	  |ПОМЕСТИТЬ Упаковки
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК УпаковкиНоменклатуры
	  |		ПО (УпаковкиНоменклатуры.Владелец = ОтборНоменклатуры.Номенклатура)
	  |ГДЕ
	  |	(ЕСТЬNULL(ОтборНоменклатуры.Характеристика, ИСТИНА), ИСТИНА) В
	  |			(ВЫБРАТЬ
	  |				МАКСИМУМ(ЕСТЬNULL(ТаблицаУсловия.Характеристика, ИСТИНА)),
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК ТаблицаУсловия
	  |			ГДЕ
	  |				ТаблицаУсловия.Номенклатура = ОтборНоменклатуры.Номенклатура)
	  |
	  |ИНДЕКСИРОВАТЬ ПО
	  |	Номенклатура
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура КАК Номенклатура,
	  |	NULL КАК Характеристика,
	  |	&ТНВЭД КАК Наименование,
	  |	КлассификаторТНВЭД.Код КАК Код,
	  |	КлассификаторТНВЭД.Наименование КАК Описание
	  |ПОМЕСТИТЬ Классификаторы
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	  |		ПО ОтборНоменклатуры.Номенклатура.ТоварнаяНоменклатураВЭД = КлассификаторТНВЭД.Ссылка
	  |ГДЕ
	  |	(ЕСТЬNULL(ОтборНоменклатуры.Характеристика, ИСТИНА), ИСТИНА) В
	  |			(ВЫБРАТЬ
	  |				МАКСИМУМ(ЕСТЬNULL(ТаблицаУсловия.Характеристика, ИСТИНА)),
	  |				ИСТИНА
	  |			ИЗ
	  |				ОтборНоменклатуры КАК ТаблицаУсловия
	  |			ГДЕ
	  |				ТаблицаУсловия.Номенклатура = ОтборНоменклатуры.Номенклатура)
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	СоответствиеНоменклатурыЕГАИС.Характеристика,
	  |	&КодПродукцииЕГАИС,
	  |	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.Код,
	  |	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.Наименование
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	  |		ПО ОтборНоменклатуры.Номенклатура = СоответствиеНоменклатурыЕГАИС.Номенклатура
	  |			И ОтборНоменклатуры.Характеристика = СоответствиеНоменклатурыЕГАИС.Характеристика
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	СоответствиеНоменклатурыЕГАИС.Характеристика,
	  |	&КодПродукцииЕГАИС,
	  |	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.Код,
	  |	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.Наименование
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	  |		ПО ОтборНоменклатуры.Номенклатура = СоответствиеНоменклатурыЕГАИС.Номенклатура
	  |			И (ОтборНоменклатуры.Характеристика ЕСТЬ NULL)
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	СоответствиеНоменклатурыВЕТИС.Характеристика,
	  |	&ИдентификаторВЕТИС,
	  |	СоответствиеНоменклатурыВЕТИС.Продукция.Идентификатор,
	  |	СоответствиеНоменклатурыВЕТИС.Продукция.Наименование
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыВЕТИС КАК СоответствиеНоменклатурыВЕТИС
	  |		ПО ОтборНоменклатуры.Номенклатура = СоответствиеНоменклатурыВЕТИС.Номенклатура
	  |			И ОтборНоменклатуры.Характеристика = СоответствиеНоменклатурыВЕТИС.Характеристика
	  |
	  |ОБЪЕДИНИТЬ ВСЕ
	  |
	  |ВЫБРАТЬ
	  |	ОтборНоменклатуры.Номенклатура,
	  |	СоответствиеНоменклатурыВЕТИС.Характеристика,
	  |	&ИдентификаторВЕТИС,
	  |	СоответствиеНоменклатурыВЕТИС.Продукция.Идентификатор,
	  |	СоответствиеНоменклатурыВЕТИС.Продукция.Наименование
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыВЕТИС КАК СоответствиеНоменклатурыВЕТИС
	  |		ПО ОтборНоменклатуры.Номенклатура = СоответствиеНоменклатурыВЕТИС.Номенклатура
	  |			И (ОтборНоменклатуры.Характеристика ЕСТЬ NULL)
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	NULL КАК Номенклатура,
	  |	NULL КАК Характеристика,
	  |	NULL КАК Сертификат,
	  |	NULL КАК Номер,
	  |	NULL КАК ДатаНачалаСрокаДействия,
	  |	NULL КАК ДатаОкончанияСрокаДействия,
	  |	NULL КАК ТипСертификата,
	  |	NULL КАК ОрганВыдавшийДокумент
	  |ПОМЕСТИТЬ Сертификаты
	  |ИЗ
	  |	ОтборНоменклатуры КАК ОтборНоменклатуры";

	Запрос.УстановитьПараметр("КодПродукцииЕГАИС", "EGAIS_code");
	Запрос.УстановитьПараметр("ИдентификаторВЕТИС", "Mercury");
	ДобавитьРеквизитыНоменклатурыВЗапрос(Запрос);	

КонецПроцедуры

// Получение публикуемых реквизитов номенклатуры.
// 
// Параметры:
//  ПубликуемыеРеквизиты - Соответствие - реквизиты справочника Номенклатура, публикуемые для торговых предложений.
//    * Ключ     - ОпределяемыйТип.ДополнительныеРеквизитыБизнесСеть - значение реквизита сопоставления.
//    * Значение - Структура - свойства реквизита:
//      ** Представление    - Строка - наименование для отображения.
//      ** ПутьКДанным      - Строка - текст запроса для получения данных.
//      ** ТипЗначения      - ОписаниеТипов - описание типа данных.
//      ** ПустоеЗначение   - Произвольный - Значение реквизита, при котором, он считается не заполненным.
//
Процедура ПолучитьРеквизитыНоменклатурыДоступныеДляПубликации(ПубликуемыеРеквизиты) Экспорт
	
	// Номенклатура.Вес.
	СвойстваРеквизита = Новый Структура;
	СвойстваРеквизита.Вставить("Представление", НСтр("ru = 'Вес'"));
	СвойстваРеквизита.Вставить("ПутьКДанным", "Номенклатура.Вес");
	СвойстваРеквизита.Вставить("ТипЗначения", Новый ОписаниеТипов("Число"));
	СвойстваРеквизита.Вставить("ПустоеЗначение", 0);
	ПубликуемыеРеквизиты.Вставить(Перечисления.РеквизитыСопоставленияНоменклатурыБизнесСеть.Вес, СвойстваРеквизита);
		
	// Номенклатура.Объем.
	СвойстваРеквизита = Новый Структура;
	СвойстваРеквизита.Вставить("Представление", НСтр("ru = 'Объем'"));
	СвойстваРеквизита.Вставить("ПутьКДанным", "Номенклатура.Объем");
	СвойстваРеквизита.Вставить("ТипЗначения", Новый ОписаниеТипов("Число"));
	СвойстваРеквизита.Вставить("ПустоеЗначение", 0);
	ПубликуемыеРеквизиты.Вставить(Перечисления.РеквизитыСопоставленияНоменклатурыБизнесСеть.Объем, СвойстваРеквизита);
	
	// Номенклатура.Производитель.
	СвойстваРеквизита = Новый Структура;
	СвойстваРеквизита.Вставить("Представление", НСтр("ru = 'Производитель'"));
	СвойстваРеквизита.Вставить("ПутьКДанным", "Номенклатура.Производитель");
	СвойстваРеквизита.Вставить("ТипЗначения", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	СвойстваРеквизита.Вставить("ПустоеЗначение", Справочники.Контрагенты.ПустаяСсылка());
	ПубликуемыеРеквизиты.Вставить(Перечисления.РеквизитыСопоставленияНоменклатурыБизнесСеть.Производитель, СвойстваРеквизита);
	
КонецПроцедуры

// См. РаботаСНоменклатуройПереопределяемый.ФормализованныеРеквизитыНоменклатурыДляВыгрузки 
Процедура ФормализованныеРеквизитыНоменклатурыДляВыгрузки(ФормализованныеРеквизиты) Экспорт
	
	ФормализованныеРеквизиты.Производитель 	= Перечисления.РеквизитыСопоставленияНоменклатурыБизнесСеть.Производитель;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Дополнение в запрос источников по дополнительным реквизитам номенклатуры.
//
// Параметры:
//   Запрос - Запрос - основной запрос сбора данных.
//
Процедура ДобавитьРеквизитыНоменклатурыВЗапрос(Запрос)
	
	БлокРеквизитовШаблон = "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	NULL,
	|	&Свойство,
	|	&Значение,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				ОтборНоменклатуры КАК Товары
	|			ГДЕ
	|				Товары.Номенклатура = Номенклатура.Ссылка)";
	
	ДоступныеДляПубликацииРеквизиты = Новый Соответствие;
	ПолучитьРеквизитыНоменклатурыДоступныеДляПубликации(ДоступныеДляПубликацииРеквизиты);
	
	МассивПодзапросов = Новый Массив;
	СчетчикРеквизитов = 0;
	Для каждого СвойстваРеквизита Из ДоступныеДляПубликацииРеквизиты Цикл
		
		Если Запрос.Параметры.ИсключенныеДополнительныеРеквизиты.Найти(СвойстваРеквизита.Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексСтрокой = XMLСтрока(СчетчикРеквизитов);
		ПутьКДанным   = СвойстваРеквизита.Значение.ПутьКДанным;
		СчетчикРеквизитов = СчетчикРеквизитов + 1;
		ТекстПодзапроса = БлокРеквизитовШаблон;
		
		ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "&Значение", ПутьКДанным);
		ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "&Свойство", "&Свойство" + ИндексСтрокой);
		
		Запрос.УстановитьПараметр("Свойство" + ИндексСтрокой, СвойстваРеквизита.Ключ);
		
		Если СвойстваРеквизита.Значение.Свойство("ПустоеЗначение") Тогда
			ТекстПодзапроса = ТекстПодзапроса + Символы.ПС
				+ "И НЕ "+ ПутьКДанным + " = &ПустоеЗначение" + ИндексСтрокой;
			Запрос.УстановитьПараметр("ПустоеЗначение" + ИндексСтрокой,
				СвойстваРеквизита.Значение.ПустоеЗначение);
		КонецЕсли;
		
		МассивПодзапросов.Добавить(ТекстПодзапроса);
		
	КонецЦикла;
	
	БлокРеквизитовПодстановка = СтрСоединить(МассивПодзапросов, Символы.ПС + Символы.ПС);
	
	// Если реквизиты не найдены, удалить БлокРеквизитовШаблон.
	Если ПустаяСтрока(БлокРеквизитовПодстановка) Тогда
		БлокРеквизитовПодстановка = "";
	КонецЕсли;
	
	Если СтрЧислоВхождений(Запрос.Текст, БлокРеквизитовШаблон) = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка компоновки запроса получения данных номенклатуры.'");
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, БлокРеквизитовШаблон, БлокРеквизитовПодстановка);
	
КонецПроцедуры

#КонецОбласти
